Autodesk.Revit.DB.TessellatedShapeBuilderTarget
Describes what TessellatedShapeBuilder
should generate, if possible.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilderTarget.Mesh
A mesh.

Autodesk.Revit.DB.TessellatedShapeBuilderTarget.AnyGeometry
A Geometry, which depending on input data can be a Solid or a 'sheet',
where there is no fully enclosed volume formed by the generated faces.

Autodesk.Revit.DB.TessellatedShapeBuilderTarget.Solid
A solid, i.e., a Geometry, where all edges are shared by two and
only two faces and which divides all 3d space into bounded inner
and infinite outer area(s).